# Используем официальный образ Go как базовый образ
FROM golang:1.22.4 AS builder

# Устанавливаем рабочую директорию
WORKDIR /dev

# УБРАЛ: Копируем go.mod и go.sum в контейнер
# УБРАЛ: COPY go.mod go.sum ./
# Копируем весь код приложения
COPY . .

# Загружаем зависимости
RUN go mod download

# Собираем приложение
RUN go build -o myapp .

# Используем небольшой образ для запуска приложения
FROM alpine:latest

# Переносим собранное приложение в новый образ
WORKDIR /app
COPY --from=builder /dev/myapp .

# УБРАЛ, но оставил для документации: даже если контейнер запущен с флагом -p, пусть другие знают, какой порт прослушивается.
# Открываем порт
# УБРАЛ: EXPOSE 8080

# Указываем, какую команду выполнять в контейнере
CMD ["./myapp"]
